import sqlite3

data = [[1, 113519718.0963, 3657454.9531, 1.0], [2, 13519726.3717, 3657460.55693, 2.0], [3, 13519734.6471, 3657466.16077, 3.0],
 [4, 13519742.9226, 3657471.7646, 4.0], [5, 13519751.198, 3657477.36843, 5.0], [6, 13519759.4734, 3657482.97226, 6.0],
 [7, 13519767.7488, 3657488.57609, 7.0], [8, 13519776.0243, 3657494.17992, 8.0], [9, 13519784.2997, 3657499.78375, 9.0],
 [10, 13519792.5751, 3657505.38759, 10.0], [11, 13519800.8505, 3657510.99142, 11.0],
 [12, 13519809.126, 3657516.59525, 12.0], [13, 13519817.4014, 3657522.19908, 13.0],
 [14, 13519825.6768, 3657527.80291, 14.0]]

# 创建数据库连接
conn = sqlite3.connect("test.db")

# 获取游标
cur = conn.cursor()

# 确保创建空表
cur.execute("DROP TABLE IF EXISTS test_coord_table;")
cur.execute("CREATE TABLE IF NOT EXISTS test_coord_table(ID INTEGER, X REAL, Y REAL, Z REAL);")

# 执行语句，批量插入数据
cur.executemany("INSERT INTO test_coord_table VALUES(?, ?, ?, ?)", data)

# 事务提交
conn.commit()

# 关闭连接
conn.close()
